
public class Test {
	public static void main(String[] args) {
		String name = "mtma****▤BESTBeforeSunrise 》 BeforeSunset 》BeforeMidnight 순서대로 보시는게 조아요. 경이로운 영화입니다.▤2013-07-05 19:31▤42▤2▒fink****▤BEST악 벌써 들어왔네요! 비포 시리즈 중에 가장 리얼리티 있음!▤2013-07-04 16:12▤25▤1▒nojj****▤BEST가슴설레는 로맨틱함은 1편이면 충분하고3편에서는 어느새 피로한 찌질해보이는 결혼생활의 현재진행형이네요 한결같은관계는 없으니..어쩌면 자연스럽네요 멀리서보면 이마저도 아름다울듯합니다▤2017-04-05 21:00▤19▤0▒dhdh****▤지겹고 재미없다. 앞부분 차안에서 잡담하는 부분 특히▤2022-12-29 19:31▤0▤2▒pg34****▤실제 부부가 아무리 사이가 좋다고 해도 저렇게 길게 서로 말을 나눠가면서 과연 길게 이야기 할 수있을까? 이거 환타지 SF 시리즈 아닐런지 연애 할 때는 그럴수 있다고 하지만 아이까지 있는 부부가!▤2022-12-29 17:41▤1▤0▒chld****▤그렇죠? 순서대로 보는 게 조겠죠? 순서대로 안 보고 이것만 보게 되었는데 인상? 깊은 아니면 감동적?인 것 같다▤2022-12-25 21:25▤0▤0▒seol****▤저는 오히려 현실적인 사랑을 보여주는 이 영화가 더 인상깊었어요. 사실 웹툰, 드라마처럼 밝고 마법같은 사랑은 현실엔 없잖아요. 다툼이 있어도 서로가 어떻게 이해하고 응어리를 푸는지의 그 과정을 보니 역설적으로 현실적인 사랑이 더 멋있어 보이는 건 왜일까요! 좋은 영화 감사합니다 :)▤2022-09-25 15:01▤2▤0▒neon****▤두 배우가 20년에 걸쳐 만든 명작이네요▤2022-02-15 16:24▤4▤0▒suji****▤개봉할 때 타이밍을 놓치고 지금에서야 봅니다. 지나치게 현실적이어서 보지 말걸 그랬다는 분도 계시지만요. 오히려 리얼한 현실 속에서 제시와 셀린느가 살아가는 그들만의 방식을 찾는 게 좋았습니다. 판타지나 동화 속 사랑이 아니라면, 결국은 이렇게 타협점을 찾아가며 살아가야 하지 않을까요. 좋은 마무리였습니다.▤2021-10-17 17:32▤4▤0▒5518****▤1편만 볼 걸.. 하 대여값 아까워서 억지로 다 봤네▤2021-05-02 13:09▤3▤7▒swb1****▤청불인데 왜 묵음처리했는지...▤2021-04-29 23:12▤0▤1▒chw9****▤순차적으로 보다가 비포미드나잇만 안 풀려서 계속 기다렸습니다. 디알엠 프리라 이제 소장겸 구매하고 갑니다▤2021-03-21 14:23▤4▤0▒yena****▤시리즈라 앞에 것도 봐야할가 봅니다. 탄탄한 줄거리에 믿음이 가는 영화!▤2019-07-01 15:33▤4▤0";
		for(String arr: name.split("▒")) {
			System.out.println(arr);
		}
	}
}
